Revit 2026 API

# NumericRevisionSettingsStartNumber Property

---

The start number for the sequence.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int StartNumber { get; set; }
```
```vb
Public Property StartNumber As Integer
	Get
	Set
```
```cpp
public:
property int StartNumber {
	int get ();
	void set (int value);
}
```
```fsharp
member StartNumber : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for number is negative. |

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace